In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
users = pd.read_csv('Users.csv')
register = pd.read_csv('Register.csv')

In [3]:
users

   user_id user_name
0        6     Alice
1        2       Bob
2        7      Alex

In [4]:
register

    contest_id  user_id
0          215        6
1          209        2
2          208        2
3          210        6
4          208        6
5          209        7
6          209        6
7          215        7
8          208        7
9          210        2
10         207        2
11         210        7

In [11]:
merge = pd.merge(users,register,how = 'cross')

res = merge.groupby(['contest_id'], as_index = False).agg(
    numerator = ('user_id_y','nunique'),
    denominator = ('user_id_x','nunique')
)
res['pct'] = round(100 * res['numerator']/res['denominator'],2)
res = res[['contest_id','pct']].sort_values(['pct','contest_id'], ascending = [False, True])
res

   contest_id     pct
1         208  100.00
2         209  100.00
3         210  100.00
4         215   66.67
0         207   33.33